src/cf/Catalogs/ПользовательскиеИстории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПользовательскиеИстории</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.БизнесЦели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимыйФункционал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Функциональности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеДействие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУчастияВПроекте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаУчастияВПроекте</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФиче</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФичи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КритерииДостижения</Name>
					<Comment>Как понять что цель достигнура</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПользовательскиеИстории/Ext/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	ОчиститьРеквизитыПриКопировании();
КонецПроцедуры

Процедура ОчиститьРеквизитыПриКопировании() 
	ПутьКФиче = "";
	Ценность = Неопределено;
	ОбъемРабот = Неопределено;
	БизнесВес = 0;
	НомерФичи = "";
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ДобавитьВПроверяемыеРеквизитыВладельца(ПроверяемыеРеквизиты);
КонецПроцедуры

Процедура ДобавитьВПроверяемыеРеквизитыВладельца(ПроверяемыеРеквизиты) 
	ПроверяемыеРеквизиты.Добавить("Владелец");
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ОпределитьНомерФичи();
	ОпределитьПутьКФиче();
КонецПроцедуры

Процедура ОпределитьНомерФичи() 
	НомерФичи = XMLСтрока(Код);
КонецПроцедуры

Процедура ОпределитьПутьКФиче()
	Если ЗначениеЗаполнено(ПутьКФиче) Тогда
		Возврат;
	КонецЕсли;
	
	КаталогПроекта = ОбщегоНазначениеСервер.ПолучитьКаталогПроекта(Ссылка);
	ИмяФичи = ОбщегоНазначенияКлиентСервер.ПолучитьИмяПеременнойИзСтроки(Заголовок);
	Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеФичи();
	
	ПутьКФиче = КаталогПроекта + "\" + ИмяФичи + Расширение;
КонецПроцедуры
